[A_YlathsClairvoyance H7HeroAbility]
mTooltipMagicGuild="立即显示目标点周围的圆形区域。"
mTooltipMagicGuildRankLine="半径 %special"
mName="风龙洞察"
mTooltip="立即显示目标点周围半径为 %special 的圆形区域。"

[Imprinted.A_LightningBurst_Imprinted_Buff_Positive H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[A_GustOfWind H7HeroAbility]
mTooltipMagicGuild="立即将目标生物推向某个方向。"
mTooltipMagicGuildRankLine="%special2.val1 格直线 或 %special2.val2 格斜线"
mTooltipUpgraded="将目标生物直线推动 %special2.val1 格或斜线推动 %special2.val2 格，并立即造成 %d.min 到 %d.max %d.icon 气系伤害。"
mName="狂风骤起"
mTooltip="立即将目标生物直线推动 %special1.val1 格或斜线推动 %special1.val2 格。"

[A_LightningBurst_Buff_Positive H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[Imprinted.A_StormArrows_Imprinted H7HeroAbility]
mName="风暴神箭"
mTooltip="提升目标友方远程生物的 %buff1.buff.stat2.icon 攻击 %buff1.buff.stat2.norm，持续 %buff1.buff.durini 回合。"

[Imprinted.A_StormArrows_Imprinted_Buff H7BaseBuff]
mName="风暴神箭"
mTooltip="%stat2 %stat2.icon 攻击\n持续 %durnow 回合。"

[Imprinted.A_LightningBurst_Imprinted H7HeroAbility]
mName="闪电爆裂"
mTooltip="在目标生物回合开始时，对所有相邻单位造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[A_LightningBurst_Buff_Negative H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[Imprinted.A_Cyclone_Imprinted H7HeroAbility]
mName="龙卷狂风"
mTooltip="立即对2x2区域内的所有生物造成 %d.min 到 %d.max %d.icon 气系伤害，并将它们随机重新定位到周围的8x8区域内。"

[A_LightningBurst_Buff_Positive_Upgraded H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻敌方单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害，并将其 %ICON_DEFENSE 防御设置为 %buff3.buff.stat.norm。如果没有相邻敌方单位，法术保持激活状态。"

[Imprinted.A_ChainLightning_Imprinted H7HeroAbility]
mName="连锁闪电"
mTooltip="立即对目标单位造成 %d.min 到 %d.max %d.icon 气系伤害，然后依次影响最多三个其他附近的随机单位，每次伤害减半。"

[Imprinted.A_LightningBolt_Imprinted H7HeroAbility]
mName="霹雳闪电"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 气系伤害。"

[Imprinted.A_LightningBolt_Imprinted_Artifact H7HeroAbility]
mName="霹雳闪电"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 气系伤害。"

[Imprinted.A_LightningBurst_Imprinted_Buff_Negative H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[Imprinted.A_GustOfWind_Imprinted H7HeroAbility]
mName="狂风骤起"
mTooltip="立即将目标生物直线推动 %special1.val1 格或斜线推动 %special1.val2 格。"

[A_StormArrows_Buff_Upgraded H7BaseBuff]
mName="风暴神箭"
mTooltip="%stat2 %stat2.icon 攻击\n%stat1.icon 全射程\n持续 %durnow 回合。"

[A_ErraticStorm_Buff_Cell H7BaseBuff]
mName="诡异暴风"

[A_StormArrows_Buff H7BaseBuff]
mName="风暴神箭"
mTooltip="%stat2 %stat2.icon 攻击\n持续 %durnow 回合。"

[A_StormArrows H7HeroAbility]
mTooltipMagicGuild="提升目标友方远程生物的 %buff1.buff.stat2.icon 攻击，持续 %buff2.buff.durini 回合。"
mTooltipMagicGuildRankLine="%buff1.buff.stat2 %ICON_ATTACK"
mTooltipUpgraded="赋予 %buff2.buff.stat1.icon 全射程，并提升目标4x4区域内所有友方远程生物 %buff1.buff.stat2.norm 点 %buff1.buff.stat2.icon 攻击，持续 %buff2.buff.durini 回合。"
mName="风暴神箭"
mTooltip="提升目标友方远程生物 %buff1.buff.stat2.norm 点 %buff1.buff.stat2.icon 攻击，持续 %buff2.buff.durini 回合。"

[Imprinted.A_YlathsClairvoyance_Imprinted H7HeroAbility]
mName="风龙洞察"
mTooltip="立即显示目标点周围半径为 %special 的圆形区域。"

UCP MOD

[Imprinted.A_ErraticStorm_Imprinted H7HeroAbility]
mName="诡异暴风"
mTooltip="在目标4x4区域制造诡异暴风，持续 %durini 战斗回合。区域内的远程生物获得 %buff1.buff.stat %icon_attack 攻击。穿过该区域被远程攻击瞄准的生物处于掩护状态，只受到10%的伤害。"

UCP 1.1

[A_ErraticStorm_Buff_Creature H7BaseBuff]
mName="诡异暴风"
mTooltip="该生物仅受到远程攻击10%的伤害。远程生物获得 %stat %icon_attack 攻击。\n只要生物在暴风区域内就持续。"

[Imprinted.A_ErraticStorm_Imprinted_Buff_Creature H7BaseBuff]
mName="诡异暴风"
mTooltip="该生物仅受到远程攻击10%的伤害。远程生物获得 %stat %icon_attack 攻击。\n只要生物在暴风区域内就持续。"

UCP 1.3 / 7.5_mod

[A_LightningReflexes_Buff H7BaseBuff]
mName="闪电反应"
mTooltip="近战攻击时获得一次额外打击，附带 %buff1.buff.stat %ICON_ATTACK 攻击力。如果敌人可以反击，则额外打击在反击之后执行。\n持续 %durnow 回合。"

[A_LightningReflexes_Buff_Upgraded H7BaseBuff]
mName="闪电反应"
mTooltip="近战攻击时获得一次额外打击，附带 %buff1.buff.stat %ICON_ATTACK 攻击力。如果敌人可以反击，则额外打击在反击之前执行。\n持续 %durnow 回合。"

[Imprinted.A_LightningReflexes_Imprinted H7HeroAbility]
mName="闪电反应"
mTooltip="近战攻击时获得一次额外打击。持续 %buff1.buff.durini 回合。如果敌人可以反击，则额外打击在反击之后执行。"

[Imprinted.A_LightningReflexes_Imprinted_Buff H7BaseBuff]
mName="闪电反应"
mTooltip="近战攻击时获得一次额外打击。如果敌人可以反击，则额外打击在反击之后执行。\n持续 %durnow 回合。"

[rework.A_Nova H7HeroAbility]
mTooltipMagicGuild="立即对2x2区域内的所有生物造成 %ICON_AIR 气系伤害，并将它们随机重新定位到周围的8x8区域内。"
mTooltipMagicGuildRankLine="%d1.min 到 %d1.max %ICON_AIR"
mTooltipUpgraded="立即对3x3区域内的所有生物造成 %d2.min 到 %d2.max %d.icon 气系伤害，并将它们随机重新定位到周围的9x9区域内。小型生物受到双倍伤害。"
mName="龙卷狂风"
mTooltip="立即对2x2区域内的所有生物造成 %d1.min 到 %d1.max %d.icon 气系伤害，并将它们随机重新定位到周围的8x8区域内。"

v1.33

[New.A_Regeneration H7HeroAbility]
mTooltipMagicGuild="立即将目标生物推向某个方向并治疗它。"
mTooltipMagicGuildRankLine="%special2.val1 格直线 或 %special2.val2 格斜线"
mTooltipUpgraded="将目标生物直线推动 %special2.val1 格或斜线推动 %special2.val2 格，并立即治疗 %d.min 到 %d.max %icon_health 生命值。\n（冷却时间：%buff1.buff.durini 回合）"
mName="疗愈微风"
mTooltip="将目标生物直线推动 %special2.val1 格或斜线推动 %special2.val2 格，并立即治疗 %d.min 到 %d.max %icon_health 生命值。\n（冷却时间：%buff1.buff.durini 回合）"

v1.35

[rework2.A_BurningDetermination H7HeroAbility]
mTooltipMagicGuild="近战攻击时获得一次附带修改后 %ICON_ATTACK 攻击力的额外打击。持续一定回合数。"
mTooltipMagicGuildRankLine="%buff1.buff.durini 回合 和 %buff1.buff.buff1.buff.stat %ICON_ATTACK"
mTooltipUpgraded="近战攻击时获得一次附带 %buff2.buff.buff1.buff.stat %ICON_ATTACK 攻击力的额外打击。持续 %buff2.buff.durini 回合。如果敌人可以反击，则额外打击在反击之前执行。\n（冷却时间：%buff9.buff.durini 回合）"
mName="闪电反应"
mTooltip="近战攻击时获得一次附带 %buff1.buff.buff1.buff.stat %ICON_ATTACK 攻击力的额外打击。持续 %buff1.buff.durini 回合。如果敌人可以反击，则额外打击在反击之后执行。\n（冷却时间：%buff9.buff.durini 回合）"

[rework.A_Nova H7HeroAbility]
mTooltipMagicGuild="立即对2x2区域内的所有生物造成 %ICON_AIR 气系伤害，并将它们随机重新定位到周围的8x8区域内。"
mTooltipMagicGuildRankLine="%d1.min 到 %d1.max %ICON_AIR"
mTooltipUpgraded="立即对3x3区域内的所有生物造成 %d2.min 到 %d2.max %d.icon 气系伤害，并将它们随机重新定位到周围的9x9区域内。小型生物受到双倍伤害。\n（冷却时间：%buff9.buff.durini 回合）"
mName="龙卷狂风"
mTooltip="立即对2x2区域内的所有生物造成 %d1.min 到 %d1.max %d.icon 气系伤害，并将它们随机重新定位到周围的8x8区域内。\n（冷却时间：%buff9.buff.durini 回合）"

v1.37

[A_ChainLightning H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %ICON_AIR 气系伤害，然后依次影响最多三个其他附近的随机单位，每次伤害减半。\n（冷却时间：%buff9.buff.durini 回合）"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %ICON_AIR"
mName="连锁闪电"
mTooltip="立即对目标单位造成 %d.min 到 %d.max %d.icon 气系伤害，然后依次影响最多三个其他附近的随机单位，每次伤害减半。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

[A_ErraticStorm H7HeroAbility]
mTooltipMagicGuild="在目标4x4区域制造诡异暴风，持续一定数量的战斗回合。区域内的远程生物 %icon_attack 攻击降低。穿过该区域被远程攻击瞄准的生物处于掩护状态，只受到10%的伤害。"
mTooltipMagicGuildRankLine="诡异暴风持续 %durini 战斗回合。%buff1.buff.stat %icon_attack 攻击。"
mName="诡异暴风"
mTooltip="在目标4x4区域制造诡异暴风，持续 %durini 战斗回合。区域内的远程生物获得 %buff1.buff.stat %icon_attack 攻击。穿过该区域被远程攻击瞄准的生物处于掩护状态，只受到10%的伤害。\n（冷却时间：%buff9.buff.durini 回合）\n如果英雄拥有超过12点 %icon_ARCANE_KNOWLEDGE 奥术知识，则冷却时间变为：%buff8.buff.durini 回合。"

v1.38

[A_LightningBurst H7HeroAbility]
mTooltipMagicGuild="在目标生物回合开始时，对所有相邻单位造成 %buff1.buff.d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"
mTooltipMagicGuildRankLine="%buff1.buff.d1.min 到 %buff1.buff.d1.max %ICON_AIR"
mTooltipUpgraded="在目标生物回合开始时，对所有相邻敌方单位造成 %buff3.buff.d1.min 到 %buff3.buff.d1.max %buff3.buff.d1.icon 气系伤害，并降低其 %ICON_DEFENSE 防御 %buff3.buff.buff3.buff.stat.norm，持续到其下一回合开始。如果没有相邻敌方单位，法术保持激活状态。"
mName="闪电爆裂"
mTooltip="在目标生物回合开始时，对所有相邻单位造成 %buff1.buff.d1.min 到 %buff1.buff.d1.max %buff1.buff.d1.icon 气系伤害。如果没有相邻单位，法术保持激活状态。"

[A_LightningBurst_Buff_Negative_Upgraded H7BaseBuff]
mName="闪电爆裂"
mTooltip="在此生物回合开始时，对所有相邻敌方单位造成 %d1.min 到 %d1.max %d1.icon 气系伤害，并降低其 %ICON_DEFENSE 防御 %buff3.buff.stat.norm，持续到其下一回合开始。如果没有相邻敌方单位，法术保持激活状态。"

[A_LightningBolt H7HeroAbility]
mTooltipMagicGuild="立即对目标敌方单位造成 %d.icon 气系伤害。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %ICON_AIR"
mTooltipUpgraded="立即对目标敌方单位及其相邻单位造成 %d.min 到 %d.max %d.icon 气系伤害，并降低其 %buff1.buff.stat.icon 防御 %buff1.buff.stat.norm，直到其下一回合开始。"
mName="霹雳闪电"
mTooltip="立即对目标敌方单位造成 %d.min 到 %d.max %d.icon 气系伤害。"

[A_Shocked_Buff H7BaseBuff]
mName="胆颤心惊"
mTooltip="%stat.norm %stat.icon 防御。持续 %durnow 回合。"